#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-neVbgTUfCM47RLPq

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_staging]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_staging]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_staging]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_staging]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_staging]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_staging-20210127152215216300000001]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_staging-20210127152215241500000004]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_staging-20210127152215239700000003]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_staging-20210127152215237300000002]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=7ae0421e-5c59-4b9e-971a-aab448662f51]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_staging-20210127132820714600000001]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_staging-20210127150546817300000001]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_staging-20210127130509124000000001]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_instance.composer_external: Refreshing state... [id=i-0ac77e3d9390f2d74]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_internal: Refreshing state... [id=i-0bb67d22477f527df]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-3904188661]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-850308169]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-a5f1a776-425a-403a-83f1-0cda8eb187fc]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-55ef7f77-4fae-4514-829f-ac9bb78715f5]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 6 -> (known after apply)
        id                      = "lt-0195b4ef20679c780"
      ~ latest_version          = 6 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZ2XLjuHq+d9W8A+JxamaqQ4mLJFs+46kjSqRWUhK4iTpJuUAQEimCi0lo7ekXyU1u83h5hBS1uGV3z5pTlRrftAj8G358/4ZupwkjCePMfUYeQbymLMxQzqpxuCP+34CXrhMf5funW62vKfLY0jst6N7elF+cTfIiTJNHIFT4b26+ueG4a6Jvbi6yO2GRpUXIjrSIMYSDmCTsb2ARUpKgmDzdhknIKnixvP3MZeYoKRYk55QEp36YLB/BvReyK4KjyYzsWBXTdO1zOE0W4fKbGy2MyRfGfXtNc3OzLkhePN4AwIHSgkdAsMiVizcAAFAUwTNasyDNwwPxnyOyP9KWfxy4LYqAywsEWq1WS5b0A2oLeywq5WenNW3JrVar3Zq2d6uF2u/T7qKdNENMe/vYyRU5Ny2RjhosMrqmQLJ7vz05bIWV23CSYEonMy0jkzzUd/qMdh+wM25WoZrJPn9oqlt9/yFaLIPmYr3X3Vqz/0FDjfHetOVlPdBTdbeAs2497DFcNaY08RQ1HGZGVKNhltamcyazeNl6WUZGq9E5BPul11jXtWa4M/u7miOv1obGd2fTg77KyGIfOusPRR9+CEQrn0bDlrxe992pl6/oBzWwYzTa5Ju9ORbXxZhtEldeBd5kux/fi85khbKhX20GJnqZKMJW3TcsVUxmuDZZbvllOPUaReip5uFeN8nOkerT5sNLNh07mjvE2XKeUwP1esO5oQXsML7X/Hk+HqnWLDWEFmnta8uAYT0fyyb16sZmci8dDvyLDFURt8e1Mb/N6tvtyyTYbMWEeVJmjibMJ2zwwa7z00mSJbO9YSTzTDyoW0xEwZvtGvdJ0KRJMMrnyxW5x+k0mbTUXRVTqaEYg/0yXE+wvP0QCQ/umrrazHpBMou2g1EEV51sZc5EUtcGQiPt3BeDHq5VnXq0X4w2vlbYgf8itGe9rm2Ps0O69Phm3XZDHs7ULJnDqkDsZbsKPzj2nrkL94HPF/YY+61U7M4XyaB+cKE1Gwya2jxCyW4nKffWOIyUgd4srJXI84dGe7/n+4v+i+kNBLm+uF/4EsIwH9U62LV8tV8V5L3uNFRhdY/nYas7Hgx17zBTeVNii4cdT4Tp0xOI0SrN/54TP0CsgtP49i3eiS/W60LziPn2CfN03ukLuqnUy7X+RBZWKq1lDdWUw13PbGzHUWP2kKyq83uSTvSpUtX47bD2UB+C1Fv7KHyj7Gabh4w8lxnhHJYZYsEjqLI4O4X3c5kjnjcoL46W4VMWeAQ/nw0dG7LVH3We22NN65tPDxJGiweeJ3WxLta8mlBb3C/q3qKOCO9LuCmI+KEpNMUzd3usTcaGAi/s94s6kRq+36w9CHV+gXDN46WG1MANX2p63n2DiORB8Bfvlbee2wo0n0YGz0aG0IaWPzBDuQPtgWVY88GUVy143ONZOxIGhgUVW9E7U2c+m/OqZFgDec5T2+roU010D7otd62oLnjinCexVjc7kQi7geWJUPZ5CB0rG3lCNkC9+cqMVAit7XBKVdnn5y/QtvVpRHtTU7WhpUo+vws1vp7NVb/AQtbRZ/OV5+iS0Q1WZiS8TGf+xFbshmnDObEExTb1GerqY3OWyf42K/dqb/YidWbaA+jzduJY0LFsVYGKyvuxtjdWamBLQW52+Tqxs8aU12WLpxJU1bkRsY0T0dSP9XH7aPOgbVmqMhd91VJU5UjrNDvl9zRS9Wki546tuoata+4hGDlOpls2TUgiw7Gly5owGGmx34cdeefO1IO/Wg5de7CyI03UqVafR8EOWtYOWTvbUR4krTOAZGUfkJilmpTtzB7tWatAsqi7GYn6QHP6O7ySbWJnpsvvkCZgybaz/XSb8noHxq6UHswZrXmq3rAFe24JcjKN6Ah1fXncUxmmmaE5zdh14J70bMNss4MXzRXDYTVNwrl7UIdz215rsV5oqp+1qc07nUEPCvMOpL5uiupmHsHcUe0OTOyR0fOHluN3zR48GIqOHEePfeo7hpohParVfN7falRFjtmvu4dA8Gbyi2a3hpYyLxxFq827KjIVIXBUGkJT1o0ZdDRF7xuJLEGebt2Erj2bWl6bHWBii14HbuyusCe9dENmQQMrULQjYYIjdeBNs5onFhKmNrN7dgS7tmoJg7Yp+rJmMcG1BMPu2YExk6F3GESeNN8ND60djN3D1KrtbUuXfd6Wp446thWhC2d+37Kp0qZzQ1Oa7SmlKoxSaW7OXU2KtvNus8BGc+jSeeZGNPNFuLaEVq5HQnus+LJm25Ex86FjCW3XUrvGyqc6XR6IKUeeuB3+Aq984YUzX52GTcmy5vrUEtpTx619Pa52rxidLjMZJpmoi5QaPK57ajbCUX9vOgJCirozFKoRZxeYEnWwiSV4oG3THlgw0bdOYvFary9BAUouD1M/XgrQ0jeGqobteJf7puzqVtOd81B0enobd5tdozcQNYVNDGdn6oI91GbuVu8WG4PSxOnh3Otmlt3TNuNZtvVWgWHHO4Z71gbywsQ0raHlDHpWm43Rykb4YMeQn8+QUpNMsy9YDrPHncHQ6wXUiNTCmgX9qbjrWF27ZkW67ppqXZ+1JLtbT8YdeWRQnye2PB1PM94SfX2atCTdto2588DrllWzlGxvJK0D6tGNrg5qY3sAocj2xNENY+bH0ygQkRToRjxfY1GTHKMp6g4V4CpgRBEa7ZXOu1FaH/JZHVqqYPTSnRv5ArZ0dyipQ8uGlt9uQu/g7v3In7lWVLeE+cilWs21A216GIz1RF0hZ7DDK6s2X0HFiKZDI9EL03iQcE+v45W60WeQd6PBWqeRMJ1pzXZ4ysnQqit9RVctCgcwop2pDdVTLueH7ytFb2yYT2THSJ4gWikYWobJsqxmWVqQvJIW3jqkfiXNl2dOZwyHCnw2jNHzUHGN5xbUn1CePKJt8VgQnBNWxChBS5I/rguOoIJxwmNTku7rotC8bzabZ6pHLyfbY1PK3asWIfQs37Bkow37E7M/1p+1lt7qnutZS+/8eWXF2itwHmZl+86dWTicxjFKfC6aujRtXvS7hqloR7/oLU15nkBF7c+ezp7hLq7itmkenRvtK3d2+vCpShiunh3HXTx5ka60oWIarwdT9M5k3NfNZwuOngLGsuKxWn17ssrrySooRoc0QduivKDqdYPxNZVfLFRYGtOv9x3/iNJV+B/nD0RpuiX+s5/GKEwK8AT+AW4ZQfE1HG7/DdwGa69SXuP79ZNvvtwCFw0YgSdw+3WrMeJwzioZKRuqs3UngX/Yvn+aHe88HadJyHL8dVd+C7RyG5yGtHWOSsyBRZqDfoyWBMilGpKDMAEtx6i8cnVSXDyCCwbio47jPR9/Vf0Ur8uB8yjutFYJWExvXgW0A4IjQDYk3wOJBwXBaeIXACU+oOkSsBQU+4Kmy4vKgjDgIxKnCZD4q7WS+ET5WXardDlAGJOiAJsQlcMlYOskIfQomBDAAgLiy8mLlJJrPeWxfJClOQPigyCWRp13y791QQDy/bwUTlOMaJAW7GofnbT7cZg8HlV8NswmebjYAxYgBrbku5yAJGWAIBYmy5LvZBaJ03wP0uT4FSYFQwl+ta/dU9rDc9yDuzLwX1WHiwvvuijv7idwX//XK8PKW60DvMeUFFfLLCAJIDuCQXVd5NXjkapemFSz9JDmXsqeESX51SmUpFjnJxfmacqObwrFvmAkBmGRfMfAYk3pW3vV/kg523xkmbTMHqheW15kCJNXwx/4Lw1nYfzG7m3IgjABwj/jSCc0nrERLsCWAIwSkBOEA4D9pPJ5cPocA/rYVL6PA7T3SfLDI3AI2IaUAkS3aF+AJWEAgRovgYDkBHgEoxI56QJgGpKEAUxyVrx1U3mdIA8IfcZ+Apy+2QOtTgcqhvHOiGvPLVBIyTVAszBZ/gln/KrIMhZqNel6KU9ZilN6SgJXGwVDbF3muRovvbsuUBQUpMe6VoCPoN0qJ7e+2m+3TKWEyDlj5UERVzGqns7LrUlWJjbw6U8d6jUX/ubhv0yO/3Ik9VARvF66QRIfHHmKEi8XMZW3+fS7ApBkE+ZpUmZBsEF5iDxKCoByAi7JkfhHaDy+sv7hdPqtott9ONY1RTcvYJ5aiqW8qdAva7Im78rxddtRDctUz3mnVM9djsSdu4izXE0xjFZXebr9n//6z/8Gd9pY75vP5SRtHuPzvGAo0O63lTJ7nVeOmEbs8tlpmcrloQMqhjUyn+6+R9sCFC8FKEjiczEpjlmA446Gc+ucgrvXUwHuQsB5qb8Ht3dnw25/OEslOEjB3Un2zU2+TnDsn943cBCnPviw+x2YOZHy9zz/vohy4JTrMKOAJOWtAo5L0u2pnPzKm+wfeV3dcUVAKD11gb/0vHqFzrJqcWSdgizMSBm9N0W6zjH5+mPOzbegS9ib8gL6ncpNXzfMlt5Wnvudp7vvcel4blQcYflYrQqNZkWs1yrnf6sUMVKwakwY4nzEUPUiiwv9H0odraIgcemfskAmKCaVG9UajV671afbu49fb2A/cXcfr4z5dFuKm+RhwkC6PhmekO2V3OOd3xqEHSvpuRhdtss4vfv4RvWnylGkcfbCO4bKzeVXeckFYdyrqLs3Yv4at312zmmo8EoHvd46SwHs6SdnQLIMC0byt7g4pu2S5uZd0Bxj9k3vX5Y87rTEbRBdE/DvZbxwJPGzNEzYKZI//tpU8enMcpYS+iX9b8xYn8DPYPUCuBzcVowjn8HyMFnegp9ODrkep57Ptj6fx6nKqkiTmwv7r1He/k5h4GdwvKQ8Btzi9xpw87WR7/wfN4Dj0JqlfyWsdUhG0z0o5+VjcTiNNsUJZ+fNEmWX8QW0W8d2KFyEGDFSufFQQRo1wPmAAz/++CO4+/juufcT+AncfbyeZD9dzUC/pCYi++OE8UbX/xeuv/I28ZtQPjny+BDxFrmfN26/TnmC5atTv/TeiYGLyP7owXeCcc7+j4IvV3MVF1+c5i8E8UutWWdndIOC5JsQkzPKJznJymbv/aT+XQFyEqeMvGc7ArNIcUTKqeAXeoyLtJOI87PO3688XlamT48P9zz/hTM57pub/w0AAP//cfzl73weAAA=" -> "H4sIAAAAAAAA/9RZ6XLjOH7/rqp5B8Tj1OxWhxIPSba866kVJVInKYmnqE3KBYKQSBEEaRI6e/tF8iVf83h5hBR1uGV3z+yRrUqNv7QI/C/88D/RnZQyTBlnHTL8BJINYVEGc1ZLoj0O/gD8dEMDmB+e77SBpsgTW++2De+uUn5xDs6LKKVPQKjyP1R+qHDcLdEPlavsblRkaRGxEy1kDKIwwZT9ASwjgilM8PNdRCNWRcvV3VcuK4e0WOKcUyhKg4iunsCDH7EbgpPJDO9ZDZF0E3Aopcto9UNFixL8jXE/3tJUKpsC58VTBQAOlBY8AYxErlysAABAUYQvcMPCNI+OOHiJ8eFEW/5x4K4oQi4vIGi3221Z0o+wIxyQqJSf3fasLbfb7U571tmvl+pgQHrLDm1FiPQPiZsrcm7ZIhk3WWz2LAFnD0FnetwJa6/p0nBGpnMtw9M80vf6nPQekTtp1Qw1kwP+2FJ3+uFTvFyFreXmoHv11uCTBpuTg+XIq0aop+p+acx7jajPUM2cEeorajTKzLhOoiytzxZMZsmq/bqKzXazewwPK7+5aWitaG8N9nVXXm9Mje/NZ0d9neHlIXI3n4qB8SkU7XwWj9ryZjPwZn6+Jp/U0EngeJtvD9ZE3BQTtqWevA796e4weRDd6Rpmo6DWCi34OlWEnXpo2qpI56g+Xe34VTTzm0Xkq9bxQbfw3pUas9bjazabuJo3QtlqkRMT9vujhamF7Dh50IJFPhmr9jw1hTZuH+qrkCE9n8gW8RvmdvogHY/8q2yoIupM6hN+lzV2u9dpuN2JlPlSZo2nLMBs+Mlp8LMpzej8YJp0kYlHdYewKPjzffOBhi1Cw3G+WK3xA0pndNpW9zVEpKZiDg+raDNF8u5TLDx6G+Jpc/sVyizeDcexse5ma2su4oY2FJpp96EY9lG95jbiw3K8DbTCCYNXoTPv9xxnkh3Tlc+3Go4X8cZczejCqAnYWXVqxifXOTBv6T3y+dKZoKCdir3Fkg4bR8+w58NhS1vEkO73kvJgT6JYGeqtwl6LPH9sdg4HfrAcvFr+UJAby4dlIEFk5ON6F3l2oA5qgnzQ3aYqrB/QImr3JsOR7h/nKm9JbPm457Ewe34GCVyn+Z9yHISQVVGa3L33dxyIjYbQOvl85+zzZNEdCLqlNMq1wVQW1iqpZ03VkqN932ruJnFz/kjXtcUDTqf6TKlp/G5Uf2yMQOpvAhi9U1bZ5RHDL2VGuIRlBln4BGosyc7h/VLmiJctzIuTZeicBZ7AXy6GTkzZHoy7L52Jpg2s50cJweUjz+OG2BDrfl2oLx+WDX/ZgJgPJNQSRPTYElrihbsz0aYTUzGu7A/LBpaaQdCqPwoNfglR3eelptREzUBq+f5DE4v4UQiWH5W3XzqKYT2PTZ6NTaFj2MHQiuSu4Qxt014MZ7xqG6c9nnViYWjahuIoenfmLuYLXpVMeygveOLYXX2mid5Rd+SeHTcEX1zwONEaVjcWjV5o+6IhB7xhuHY29oVsCPuLtRWrhmHvRjOiygG/eDUcR5/FpD+zVMewVSng95HGN7KFGhRIyLr6fLH2XV0ye+HaioXX2TyYOorTtBxjgW1BcSx9Dnv6xJpncrDLyr36u71YnVvO0Ah4h7q24dqOqhiKygeJdjDXauhIYW71+AZ2suaM12WbJ5KhqgszZls3JmmQ6JPOyeZhx7ZVZSEGqq2oyonWbXXL71ms6jMq566jeqaja94xHLtuptsOoZjKxsTWZU0YjrUkGBhdee/N1WOwXo08Z7h2Yk3UidZYxOHesO09tPeOqzxKWndo4LVzhGKWalK2t/qkb69DySbedizqQ80d7NFadrCTWR6/h5qAJMfJDrNdyutdI/Gk9GjNSd1X9aYjOAtbkOksJmPYC+RJX2WIZKbmthLPNQ6475hWhx39eKGYLqtrEsq9ozpaOM5GS/RCU4OsQxze7Q77hrDoGiTQLVHdLmIjd1Wna1BnbPaDke0GPatvHE1Fh66rJwEJXFPNoB7X6wEf7DSiQtcaNLxjKPhz+VVz2iNbWRSuotUXPRVaihC6KokMS9bNueFqij4wqSwZPNl5lGx8h9h+hx0N6oh+19g6PeGA++kWz8MmUgzRiYUpitWhP8vqvlhIiDjM6Tux0XNUWxh2LDGQNZsJni2YTt8Jzbls+Mdh7EuL/ejY3huJd5zZ9YNj63LAO/LMVSeOIvSMeTCwHaJ0yMLUlFZnRohqxKm0sBaeJsW7Ra9VILM18sgi82KSBaKxsYV2rsdCZ6IEsuY4sTkPDNcWOp6t9sx1QHSyOmJLjn1xN/oFXvnKa8wDdRa1JNte6DNb6Mxcr/79uNq/+ehslckGzURdJMTkUcNXszGKBwfLFSBU1L2pEA27+9CSiIssJBlH0rGcoW1QfedSm9f6A8kQDMnjjTRIVoJh61tTVaNOss8DS/Z0u+UteEN0+3oH9Vo9sz8UNYVNTXdv6YIz0ubeTu8VW5MQ6vZR7vcy2+lr28k82/nr0HSSPUN9e2vwwtSy7JHtDvt2h03g2oHo6CQGv5hDpS5Z1kCwXeZMusOR3w+JGauFPQ8HM3HftXtO3Y513bPUhj5vS06vQSddeWySgMeOPJvMMt4WA31G25LuOObCfeR1267bSnYwafsI+2Srq8P6xBkahsgO2NVNcx4kszgUoRTqZrLYIFGTXLMl6i4RjHXIsCI0O2ud9+K0MeKzhmGrgtlP914cCMjWvZGkjmzHsINOy/CP3iGIg7lnxw1bWIw9otU9J9Rmx+FEp+oausM9Wtv1xdpQzHg2MqleWOajhPp6A63VrT43eC8ebnQSC7O51upE55xs2A1loOiqTYyhEZPuzDHUcy7nRx8rRX9iWs94z3BOIakWDK4iuiqrWZYWOK+mhb+JSFBN89VHzna3ayim+Sw8iFVJqDbrVUG40LgTY6QYL6Y5fhkpnvnSNvRnmNMnuCueCoxyzIoEUrjC+dOm4DAsGCc8tSTpoSEKrYdWq3WhevJzvDs1rtyDamNMLvJNWzY7xmBqDSb6i9bW271LzWvr3X9cWbHxC5RHWdnicxcWDqVJAmnAxTOPpK2rfs+0FO2End7WlJepoaiD+fMFPe4KJ7dL8/jSjN8A1x0YzzXMUO0CLndF+ypd6RiKZb4dTNG708lAt15sY/wcMpYVT7Xa+5NV305WhQk8phTuivISa7dNyPdUfrNQZWlCvt+b/DlO19F/XD4gIekOBy9BmsCIFuAZ/BncMQyTW5e5+zdwF278anmNH9fP2Hy7Ba4aEATP4O77ViPIoZxVM1w2XRfrzgL/bvv+aXZ8QDpJacRy9H0ofwRauQ3Og9wmh6XPgWWag0ECVxjIpRqcg4iCtmtW37i6KSqewNUHkpOO0z2fftWCFG3KofQk7rxWDVlCKm8COiFGMcBbnB+AxIMCo5QGBYA0ACRdAZaC4lCQdHVVWWAGAoiTlAKJv1kric+UX2W3S8gBRAgXBdhGsBxAAdtQislJMMaAhRgk15MXKcG3espjBSBLcwbER0Esjbrsln+bAgMYBHkpnKQIkjAt2M0+PGsPkog+nVR8NczBebQ8ABZCBnb4pxwDmjKAIYvoquQ7m4WTND+AlJ6+IlowSNGbfZ2+0hld4h7cl4H/pjpaXnk3RXl3P4OHxr/eGFbeagOgAyK4uFlmIaYA7zECtU2R105HqvkRrWXpMc39lL1AgvObUyi02ORnCPM0Zad3h+JQMJyAqKA/MbDcEPLeXnUwVi42n1imbasPareWFxlE+M3wR/5bw1mUvLN7F7EwokD4Zxzp7I0X34iWYIcBghTkGKIQoIBWvw5XX2NAn1jK75IQHgJMf/8EXAx2ESEAkh08FGCFGYCgzksgxDkGPkaw9Jx0CRCJMGUA4ZwV72EqrxPkISYvKKDAHVh9cCluH4y4RW4JI4JvHTSL6OofAONXRZaxUK9Lt0t5ylKUknMSuNkoGGSbMs/VeenDdYGiICA91bUCfAaddjndDdRBp20ppYtcMlYeFkkNwdr5vNwGZ2ViA1/+oUO95cK/evhvk+O/nEh9WIRvl25iGoATT1H6y1VM9X0+/akAmG6jPKVlFgRbmEfQJ7gAMMfgmhxxcHKNpzfWvzud/qjozsCY6JqiW1dnntmKrbyr0K8bvMEfyvFt21GLylTP+edUz12PxF26iItcTTHNdk95vvuf//rP/wb32kQfWC/ltG2d4vOyYCqGM+goZfa6rJx8GrLrZ7dtKdfHEEMx7bH1fP87uCtA8VqAAtOAS3BxygIcdzKc2+QE3L+dCnBXAs5PgwO4u78Ydvf7i1SMwhTcn2VXKvmGoiQ4v4GgMEkD8Gn/N/jMmZR/4PmPRZQD51yHGAGYlrcKOI6mu3M5+ZV327/nBXbPFSEm5NwF/tIT7I13llWLw5sUZFGGy+itFOkmR/j7Dz6VH0EPs3flBQy61cpAN6223lFeBt3n+9+hEnhuXJzc8qlWE5qtqtioVy//1ghkuGC1BDPIBZDB2lUWFwW/L3W0iwInJT5lgaQwwdWKao/Hb93q89395+83sF+4+883xny5K8VN84gykG7OhlO8u5F7uvM7E7NTJb0Uo+t2Gaf3n9+p/lI9iTQvKHxgqFauv8pLLjDj3kTdvxPz27jtCzjnocIvAXq7dZYCo6+fwTDwKioYzt/7xSltlzSVD0Fzitl3vX9Z8rjzEreFZIPBv5fxwmEaZGlE2TmSP//aVPHlwnKREgUl/V+Zsb6Av4D1K+BycFc1T3wmyyO6ugM/nwG5HadeLra+XMap6rpIaeXK/muUd3+jMPAXcLqkPAHc8m81oPK9ke/ynzuA4+CGpb8lX+vijKQHUM7Lp+JwHm2Ks59dNksvu44voNM+tUPRMkKQ4WrFhwVu1gEXAA788Y9/BPefPzwJfwE/g/vPt5Psl5sZ6JfUxPhwmjDe6fr/8uvvvE38VVc+A3l6iHjvuV837r5PeXbLN1C/Re/MwMX4cELwg2CUs/+j4OvV3MTFN6f57bn4qTkoq8N3HL2sLpvshqTyI7Am3cn7mYFiHJR5GKV0i/OyHkWnzrKrm6AssTnYlb3uDgMCNxSF1QqC7BQUdzdIX8aEL7fol1Xqyx34+edbE35DEF/L+Sa74AoKnG8jhC/4TnOclf30x8eQnwqQ4yRl+CPbKfaLFMW4HLx+oY27SjuLuLyc/ekjrE+PDzz/DZgc90PlfwMAAP//ORGkuwMgAAA="
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 6 -> (known after apply)
        id                      = "lt-0a23e96f3feb1649c"
      ~ latest_version          = 6 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZ2XLjOHe+V9W8A+JxamaqQ4mLFsv/eOoXJVIrKXEX9SflAkFIpAguJqG1p18kN7nN4+URUtTilt09a/6q1PimReAsHw4+nIOD7qYJxQllzEOGH0G8ITTMYE5rcbjH/t+Al24SH+aHpztlqEji1FJ7Hd29q5RfjI3zIkyTR8BV2W8q31QY5lbom8rVdi8ssrQI6UkWUgpREOOE/g0sQ4ITGOOnuzAJaRUtV3eftcwcJsUS54yUoNQPk9UjaHkhvRE4QaZ4T2uIpBufQWmyDFffVJQwxl+A+/ZWplLZFDgvHisAMKBE8Agw4plysAIAAEURPMMNDdI8PGL/OcKHk2z5x4C7ogiYvICg0+l0REE9wi53QLxUfvY6WkfsdDrdjtbdr5fycEj6y27SDhEZHGInl8TctHgyadLI6Jsczlp+d3bccWu36SSBRmZzJcOzPFT36pz0H5Azbdd0ORN99tiWd+rhQ7RcBe3l5qC69fbwgwKb04Npi6tGoKbyfqnP+41wQFHN0EjiSXI4zoyoTsIsrWsLKtJ41XlZRUan2TsGh5XX3DSUdrg3h/u6I643hsL259pRXWd4eQidzYdiqH8IeCvXonFH3GyGrubla/JBDuwYTrb59mBO+U0xpdvEFdeBN9sdpi3ema1hNvZr7cCELzOJ28mHpiXzyRzVZ6sduwo1r1mEnmweW6qJ947Q0NoPL5k2dRR3jLLVIicGHAzGC0MJ6HHaUvxFPp3I1jw1uA7uHOqrgCI1n4om8RrGdtYSjkf2RdRlHnWn9Sm7yxq73css2O74hHpCZk5m1Md09MFusNosyZL5wTCSRcYf5R3CPOfN981WErRJEkzyxWqNWyjVkllH3tcQEZqSMTqsws0MibsPEffgboirzK0XKNJoN5pE+rqXrc05jxvKiGumvVYxGqB6zWlEh+Vk6yuFHfgvXHc+6Nv2NDumK49tN2w3ZPW5nCULvcZhe9Wt6R8c+0DdpfvA5kt7ivxOyvcXy2TUOLq6NR+N2soigsl+L0gtaxpG0khtF9aaZ9ljs3s4sMPl8MX0RpzYWLaWvgCRnk/qPeRavjysceJBdZoyt26hRdjpT0dj1TvOZdYU6PJhz2JOe3oCMVyn+d9z7AeQVlEa373lO/b5RoNrnzjfPXOeLHpDTjWlRjk2nIncWib1rCmbYrgfmM3dNGrOH5J1bdHC6UzVpJrC7sb1h8YYpN7Gh+EbZ5VdHlL8XGaEy7HMIA0eQY3G2fl4P5c54nkL8+KEDJ2zwCP4+QJ0aojWcNJ77k4VZWg+PQgILh9YFjf4Bl/36lx92Vo2vGUDYtYXUJvj0UOba/MX7e5UmU0NSb+qt5YNLDR9v11/4BrsEqK6xwpNoYmavtD2vFYT8/iB85fvnXeeu5JuPk0Mlk4Mrqtb/sgMxZ5ujyzDWow0Vrb00xxLuxE3MixdsiW1pzmL+YKVBcMaiQuW2FZP1RTePaq22LeiBufxCxbHSsPsRbzeDyyP10Wf1XXHyiYel43gYLE2I1nXrd1YI7Los4sX3bZVLSIDzZRt3ZIFn92HCtvIFrJfIC7rqfPF2nNUwegHazPiXrS5P7Mlu2na+gJbnGSb6hz21ak5z0R/l5Vz9TdzkTw37ZHus3biWLpj2bKkSzLrx8rBWMuBLQS52Wcb2M6aGquKFksEXZYXRkS3TkRSP1an3RPmUdeyZGnB+7IlydJJ1mn3ym8tklUtEXPHll3DVhX3GEwcJ1MtmyQ4EfWppYoKN5oosT/Ue+LenctHf70au/ZobUcKrxKlsYiCvW5Ze2jtbUd6EJTeSMdr+wj5LFWEbG8OyMBaB4JF3O2EV0eKM9yjtWhjOzNddg8VDgm2nR20XcqqPT12hfRozkndk9WmzdkLixMTLSIT2PfF6UCmiGSG4rRj19EPeGAbZpcevWghGQ6tKwLK3aM8Xtj2RonVQpH9rEts1umNBjq36OnEV01e3i4iPXdku6cn9sQY+GPL8fvmQD8akgodR4194juGnEE1qtd91t8pRIaOOWy4x4Dz5uKLYnfGlrQoHEmpL/oyNCUucGQS6qaoGnPdUSR1aCSioLNk5yZk49nE8rr0qCc27/X0rd3nDniQbvE8aCJJ5+2Im6FIHnlaVvf4QkDEpvbAjvS+LVvcqGvyvqhYlHMtzrAHdmDMRd07jiJPWOzHx85ej92jZtUPtqWKPmuLmiNPbYnr63N/aNlE6pKFoUjtrkaIrEepsDAXriJEu0W/XSCjPXbJInMjkvm8vrG4Tq5GXHcq+aJi25Ex93XH4rquJfeNtU9UsjpiU4w8fjf+BV3xqqvPfVkL24JlLVTN4rqa49a/fq72rxzVVpmoJxmv8oQYLGp4cjZB0fBgOhyEkrw3JKJgZx+YAnGQiQT9SLqmPbL0RN05icUqg6Ggc7rgsnrqxytOt9StIcthN97nvim6qtV2F6zOOwO1i/rtvjEY8YpEZ4azN1XOHitzd6f2i61BSOIMUO71M8seKNvpPNt568Cw4z1FA2urs9zMNK2x5YwGVpdO4dqG6GjHOruYQ6kumOaQsxxqT3ujsTcIiBHJhTUPhhq/71l9u25FquqackOddwS730imPXFiEJ/FtqhNtYy1eF/Vko6g2raxcB5Y1bLqlpQdjKRzhAOyVeVRfWqPdJ2nB+yohjH3Yy0KeCgEqhEvNohXBMdo86pDOH0dUCxxze5aZd0obYzZrKFbMmcM0r0b+RyyVHcsyGPL1i2/29a9o3vwI3/uWlHD4hYTlyh11w4U7Tiaqom8hs5oj9ZWfbHWJSPSxkaiFqbxIKCB2kBreavOddaNRhuVRJw2V9rd8JyTdashDSVVtog+0iPS02xdPudydvy+UgymhvkUJhTnCSTVgsJVmKzKapalBc6raeFtQuJX03x10XSm+ljSnw1j8jyWXOO5o6tPME8e4a54LDDKMS1imMAVzh83BYNhQRnusS0IrQbPtVvtdvsi9ejleHe6lDIt2cKYXOwblmh09eHMHE7VZ6WjdvqXetZRe3/eWbHxCpSHWXl9Zy4qDErjGCY+E2kuSdtX/65hSsopLmpHkZ5nuiQP50+XyDDXUDG7NI8uF+2bcPaG+lMNU1S7BI65RvJqXerqkmm8LkxSe7PpUDWfLX3yFFCaFY+12jZDmGF9TuAadYFtNuptj0M+0z7u89axsa2+XXn1deXVUrEKY3hME7gryl2s3d5Cvobri4EqTWPy9cvJP6J0Hf7H5QMSku6w/+ynMQyTAjyBf4A7imF8y5m7fwN3wcarlnv9fvwcwC+nwNUDguAJ3H0dNYIMymk1w+Wt64LubPAP4/un4XgX6ThNQpqjr4fyW6CU0+DcyW1yWBITLNMcDGO4wkAs3eAchAnoOEb1VauXouIRXIkSn3yc9vn0q+anaFN2pSdz57FqQGNSeTXQDTCKAN7i/AAEFhQYpYlfAJj4gKQrQFNQHAqSrq4uC0yBD3GcJkBgb8ZK4bPkZ9udMuQAIoSLAmxDWHaggG6SBJOTYYwBDTCIrysvUoJv/ZTL8kGW5hTwDxxfgrrMln+bAgPo+3lpnKQIkiAt6M08PHv34zB5PLn4DMzGebg8ABpACnb4uxyDJKUAQxomq1LvDAvHaX4AaXL6CpOCwgS94usOpO74khzAfZkdXl2Hy6vupij37ifQavzrDbByVxsAHRDBxc0wDXAC8B4jUNsUee20pJoXJrUsPaa5l9JnSHB+swopKTb5OYR5mtLTw0NxKCiOQVgk31Gw3BDyFq88nEgXzCeVWcccgNot8iKDCL8Cf2C/BE7D+A3uXUiDMAHcP2NJZzZeuBEuwQ4DBBOQY4gCgPyk+rm7+nwG1KkpfR8H8ODj5IdH4GCwCwkBkOzgoQArTAEEdVYAAc4x8DCCJXPSJUAkxAkFCOe0eBumcjtBHmDyjPwEOENzADq9ni4ZxjsQt5FbwpDgW4JmYbL6E8H4VZPlWajXhduhPKUpSsk5CdxMFBTSTZnn6qzwbrtAURCQnopfAT6Cbqds74bysNsxpZIil4yVB0VcQ7B2Xi+zwVmZ2MCnP7Wo11z4m4v/Mjn+y0nUg0XwuukGTnxw0ilKvlzNVN/m0+8KgJNtmKdJmQXBFuYh9AguAMwxuCZH7J+o8fiq+ofT6beSag/1qapIqnkls2ZJlvSmjL9s8OZ9Ob69m9TCMtUz3jnVM9clMZerxsWuIhlGpy893f3Pf/3nf4N7ZaoOzeey3TZP5/MyYEi6PexKZfa6jJw4Den1s9cxpetriC4Z1sR8uv8e7gpQvBSgwInPxLg4ZQGGOQFnNjkB96+rAsxVgPFS/wDu7i/A7n64WMUoSMH92Xalkm8SFPvnRxAUxKkPPux/B2fOomyLZd8XUQaccx2iBOCk3FXAMEm6O5eTX3m4/SNPsHumCDAh56viL73B3rCzrFoM3qQgCzNcnt5KkW5yhL/+4lP5FvQxfVNewLBXrQxVw+yoXel52Hu6/x6VgWcmxYmWj7Ua12xX+Ua9evm3RiDFBa3FmELGhxTWrraY0P+h9NEpChyX8SkLZAJjXK3I1mTyeqV9urv/+PVb7ifm/uMNmE93pblZHiYUpJsz8ATvbuye9vzOwPRUSS/F6DpdntP7j29cf6qeTBqXKLxTqFauv8pNLjBlXk3dvzHz19jtS3DOnYdXBuh112kK9IF6DoaOV2FBcf6WF6e0XcpU3h2a05l90wCUJY85DzFbSDYY/Ht5Xhic+FkaJvR8kj/+Wuvx6aJysRL6pfxvNGKfwM9g/QKYHNxVjZOeQfMwWd2Bn84Bue25ni9Yny89V3VdpEnlqv5rkne/0xj4GZw2KY8Bs/y9ACpf6wsv/7sDGAZuaPpX4loPZyQ9gLKpPhWHc2tTnHl2mSxZdm1fQLdzug6FyxBBiqsVDxa4WQeMDxjw448/gvuP796EP4GfwP3H23b3000P9EtuInw4dRhvfP1/8forDxi/SeVzIE+vFW+Z+3ni7uuSZ1q+BvXL6J0VmAgfThF8Zxjl9P9o+Lo1N+fii9X8hSh+rTWb7MJuUOB8GyJ8Yfksx1l52XvfqX9XgBzHKcXv1U7ELFIU4bIr+IU7xtXa2cTl7efvNxEvK9Onx4cWy34RTIb5pvK/AQAA//8uvynmoR4AAA==" -> "H4sIAAAAAAAA/9RZ6XLjOH7/rqp5B8Tj1OxWhxIPSba866kVJVInKYmnqE3KBYKQSBEEaRI6e/tF8iVf83h5hBR1uGV3z+yRrUqNv7QI/C/88D/RnZQyTBlnHTL8BJINYVEGc1ZLoj0O/gD8dEMDmB+e77SBpsgTW++2De+uUn5xDs6LKKVPQKjyP1R+qHDcLdEPlavsblRkaRGxEy1kDKIwwZT9ASwjgilM8PNdRCNWRcvV3VcuK4e0WOKcUyhKg4iunsCDH7EbgpPJDO9ZDZF0E3Aopcto9UNFixL8jXE/3tJUKpsC58VTBQAOlBY8AYxErlysAABAUYQvcMPCNI+OOHiJ8eFEW/5x4K4oQi4vIGi3221Z0o+wIxyQqJSf3fasLbfb7U571tmvl+pgQHrLDm1FiPQPiZsrcm7ZIhk3WWz2LAFnD0FnetwJa6/p0nBGpnMtw9M80vf6nPQekTtp1Qw1kwP+2FJ3+uFTvFyFreXmoHv11uCTBpuTg+XIq0aop+p+acx7jajPUM2cEeorajTKzLhOoiytzxZMZsmq/bqKzXazewwPK7+5aWitaG8N9nVXXm9Mje/NZ0d9neHlIXI3n4qB8SkU7XwWj9ryZjPwZn6+Jp/U0EngeJtvD9ZE3BQTtqWevA796e4weRDd6Rpmo6DWCi34OlWEnXpo2qpI56g+Xe34VTTzm0Xkq9bxQbfw3pUas9bjazabuJo3QtlqkRMT9vujhamF7Dh50IJFPhmr9jw1hTZuH+qrkCE9n8gW8RvmdvogHY/8q2yoIupM6hN+lzV2u9dpuN2JlPlSZo2nLMBs+Mlp8LMpzej8YJp0kYlHdYewKPjzffOBhi1Cw3G+WK3xA0pndNpW9zVEpKZiDg+raDNF8u5TLDx6G+Jpc/sVyizeDcexse5ma2su4oY2FJpp96EY9lG95jbiw3K8DbTCCYNXoTPv9xxnkh3Tlc+3Go4X8cZczejCqAnYWXVqxifXOTBv6T3y+dKZoKCdir3Fkg4bR8+w58NhS1vEkO73kvJgT6JYGeqtwl6LPH9sdg4HfrAcvFr+UJAby4dlIEFk5ON6F3l2oA5qgnzQ3aYqrB/QImr3JsOR7h/nKm9JbPm457Ewe34GCVyn+Z9yHISQVVGa3L33dxyIjYbQOvl85+zzZNEdCLqlNMq1wVQW1iqpZ03VkqN932ruJnFz/kjXtcUDTqf6TKlp/G5Uf2yMQOpvAhi9U1bZ5RHDL2VGuIRlBln4BGosyc7h/VLmiJctzIuTZeicBZ7AXy6GTkzZHoy7L52Jpg2s50cJweUjz+OG2BDrfl2oLx+WDX/ZgJgPJNQSRPTYElrihbsz0aYTUzGu7A/LBpaaQdCqPwoNfglR3eelptREzUBq+f5DE4v4UQiWH5W3XzqKYT2PTZ6NTaFj2MHQiuSu4Qxt014MZ7xqG6c9nnViYWjahuIoenfmLuYLXpVMeygveOLYXX2mid5Rd+SeHTcEX1zwONEaVjcWjV5o+6IhB7xhuHY29oVsCPuLtRWrhmHvRjOiygG/eDUcR5/FpD+zVMewVSng95HGN7KFGhRIyLr6fLH2XV0ye+HaioXX2TyYOorTtBxjgW1BcSx9Dnv6xJpncrDLyr36u71YnVvO0Ah4h7q24dqOqhiKygeJdjDXauhIYW71+AZ2suaM12WbJ5KhqgszZls3JmmQ6JPOyeZhx7ZVZSEGqq2oyonWbXXL71ms6jMq566jeqaja94xHLtuptsOoZjKxsTWZU0YjrUkGBhdee/N1WOwXo08Z7h2Yk3UidZYxOHesO09tPeOqzxKWndo4LVzhGKWalK2t/qkb69DySbedizqQ80d7NFadrCTWR6/h5qAJMfJDrNdyutdI/Gk9GjNSd1X9aYjOAtbkOksJmPYC+RJX2WIZKbmthLPNQ6475hWhx39eKGYLqtrEsq9ozpaOM5GS/RCU4OsQxze7Q77hrDoGiTQLVHdLmIjd1Wna1BnbPaDke0GPatvHE1Fh66rJwEJXFPNoB7X6wEf7DSiQtcaNLxjKPhz+VVz2iNbWRSuotUXPRVaihC6KokMS9bNueFqij4wqSwZPNl5lGx8h9h+hx0N6oh+19g6PeGA++kWz8MmUgzRiYUpitWhP8vqvlhIiDjM6Tux0XNUWxh2LDGQNZsJni2YTt8Jzbls+Mdh7EuL/ejY3huJd5zZ9YNj63LAO/LMVSeOIvSMeTCwHaJ0yMLUlFZnRohqxKm0sBaeJsW7Ra9VILM18sgi82KSBaKxsYV2rsdCZ6IEsuY4sTkPDNcWOp6t9sx1QHSyOmJLjn1xN/oFXvnKa8wDdRa1JNte6DNb6Mxcr/79uNq/+ehslckGzURdJMTkUcNXszGKBwfLFSBU1L2pEA27+9CSiIssJBlH0rGcoW1QfedSm9f6A8kQDMnjjTRIVoJh61tTVaNOss8DS/Z0u+UteEN0+3oH9Vo9sz8UNYVNTXdv6YIz0ubeTu8VW5MQ6vZR7vcy2+lr28k82/nr0HSSPUN9e2vwwtSy7JHtDvt2h03g2oHo6CQGv5hDpS5Z1kCwXeZMusOR3w+JGauFPQ8HM3HftXtO3Y513bPUhj5vS06vQSddeWySgMeOPJvMMt4WA31G25LuOObCfeR1267bSnYwafsI+2Srq8P6xBkahsgO2NVNcx4kszgUoRTqZrLYIFGTXLMl6i4RjHXIsCI0O2ud9+K0MeKzhmGrgtlP914cCMjWvZGkjmzHsINOy/CP3iGIg7lnxw1bWIw9otU9J9Rmx+FEp+oausM9Wtv1xdpQzHg2MqleWOajhPp6A63VrT43eC8ebnQSC7O51upE55xs2A1loOiqTYyhEZPuzDHUcy7nRx8rRX9iWs8RZTinkFQLBlcRXZXVLEsLnFfTwt9EJKim+eojZ7vbNRTTfBb4qsRXhceqIFxI3IkxUowX0xy/jBTPfGkb+jPM6RPcFU8FRjlmRQIpXOH8aVNwGBaME55akvTQEIXWQ6vVulA9+TnenfpW7kG1MSYX+aYtmx1jMLUGE/1Fa+vt3qXktfXuP66s2PgFyqOs7PC5CwuH0iSBNODimUfS1lW/Z1qKdoJOb2vKy9RQ1MH8+QIed0WT26V5fOnFb3DrDoznGmaodsGWu4J9la50DMUy3w6m6N3pZKBbL7Yxfg4Zy4qnWm2bIczxgSAJjbrENxv1li+ggGsd9/nDsbGtvj959e3k1ZKxChN4TCncFeVF124ble/Z9c1ClaUJ+X7/8uc4XUf/cfmAhKQ7HLwEaQIjWoBn8GdwxzBMbt3q7t/AXbjxq+Vdf1w/A/jtFrhqQBA8g7vvW40gh3JWzXDZmF2sOwv8u+37p9nxAekkpRHL0feh/BFo5TY4D3ubHJaOCZZpDgYJXGEgl2pwDiIK2q5ZfePqpqh4AldHSU46Tvd8+lULUrQpB9eTuPNaNWQJqbwJ6IQYxQBvcX4AEg8KjFIaFADSAJB0BVgKikNB0tVVZYEZCCBOUgok/matJD5TfpXdLiEHECFcFGAbwXJIBWxDKSYnwRgDFmKQXE9epATf6imPFYAszRkQHwWxNOqyW/5tCgxgEOSlcJIiSMK0YDf78Kw9SCL6dFLx1TAH59HyAFgIGdjhn3IMaMoAhiyiq5LvbBZO0vwAUnr6imjBIEVv9nX6Smd0SQ7gvswOb6qj5ZV3U5R39zN4aPzrjWHlrTYAOiCCi5tlFmIK8B4jUNsUee10pJof0VqWHtPcT9kLJDi/OYVCi01+hjBPU3Z6mygOBcMJiAr6EwPLDSHv7VUHY+Vi84ll2rb6oHZreZFBhN8Mf+S/NZxFyTu7dxELIwqEf8aRzt548Y1oCXYYIEhBjiEKAQpo9esA9jUG9Iml/C4J4SHA9PdPwMVgFxECINnBQwFWmAEI6rwEQpxj4GMES89JlwCRCFMGEM5Z8R6m8jpBHmLyggIK3IHVB5cC+MGIW+SWMCL41kGziK7+ATB+VWQZC/W6dLuUpyxFKTkngZuNgkG2KfNcnZc+XBcoCgLSU/ErwGfQaZcT4EAddNqWUrrIJWPlYZHUEKydz8ttcFYmNvDlHzrUWy78q4f/Njn+y4nUh0X4dukmpgE48RSlv1zFVN/n058KgOk2ylNaZkGwhXkEfYILAHMMrskRByfXeHpj/bvT6Y+K7gyMia4punV15pmt2Mq7Mv66wZuP5fi2N6lFZarn/HOq565H4i6txkWupphmu6c83/3Pf/3nf4N7baIPrJdyIrdO8XlZMBXDGXSUMntdVk4+Ddn1s9u2lOuDiaGY9th6vv8d3BWgeC1AgWnAJbg4ZQGOOxnObXIC7t9OBbgrAeenwQHc3V8Mu/v9RSpGYQruz7IrlXxDURKc30lQmKQB+LT/G3zmTMo/8PzHIsqBc65DjABMy1sFHEfT3bmc/Mrb7t/zSrvnihATcm4Vf+mZ9sY7y6rF4U0KsijDZfRWinSTI/z9R6HKj6CH2bvyAgbdamWgm1Zb7ygvg+7z/e9QCTw3Lk5u+VSrCc1WVWzUq5d/awQyXLBaghnkAshg7SqLi4LflzraRYGTEp+yQFKY4GpFtcfjt5b2+e7+8/e73C/c/ecbY77cleKmeUQZSDdnwyne3cg93fmdidmpkl6K0XW7jNP7z+9Uf6meRJoXFD4wVCvXX+UlF5hxb6Lu34n5bdz2BZzz5OGXAL3dOkuB0dfPYBh4FRUM5+/94pS2S5rKh6A5xey7AaAsedx5idtCssHg38t44TANsjSi7BzJn39t9PhyYblIiYKS/q8MYl/AX8D6FXA5uKuaJz6T5RFd3YGfz4DczlwvF1tfLjNXdV2ktHJl/zXKu79RGPgLOF1SngBu+bcaUPneXHj5DyDAcXDD0t+Sr3VxRtIDKIfqU3E4jzbF2c8um6WXXccX0Gmf2qFoGSHIcLXiwwI364ALAAf++Mc/gvvPH56Nv4Cfwf3n23H3y80M9EtqYnw4TRjvdP1/+fV3HjD+qiufgTy9Vrz33K8bd9+nPLvlG6jfondm4GJ8OCH4QTDK2f9R8PVqbuLim9P89lz81ByU1eE7jl5Wl012Q1L5EViT7uT9zEAxDso8jFK6xXlZj6JTZ9nVTVCW2Bzsyl53hwGBG4rCagVBdgqKuxukL2PCl1v0yyr15Q78/POtCb8hiK/lfJNdcAUFzrcRwhd8pznOyn7642PITwXIcZIy/JHtFPtFimJcDl6/0MZdpZ1FXJ7X/vQR1qfHB57/BkyO+6HyvwEAAP//us6ReicgAAA="
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210128223638487000000003" -> (known after apply)
      ~ id                                  = "sfr-a5f1a776-425a-403a-83f1-0cda8eb187fc" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0195b4ef20679c780" -> null
              - version = "6" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0195b4ef20679c780"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210128223638570100000004" -> (known after apply)
      ~ id                                  = "sfr-55ef7f77-4fae-4514-829f-ac9bb78715f5" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0a23e96f3feb1649c" -> null
              - version = "6" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0a23e96f3feb1649c"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*